Revit 2027 API
BuiltInFailures.GenericMEPFailures.FailedToPlaceCapWarning Property
 Failed to place cap on the open connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FailedToPlaceCapWarning { get; }
Public Shared ReadOnly Property FailedToPlaceCapWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FailedToPlaceCapWarning {
	FailureDefinitionId^ get ();
}
static member FailedToPlaceCapWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GenericMEPFailures Class
Autodesk.Revit.DB Namespace